export const Question = [
  {
    id: 1,
    question: '내가 우연히 범행 현장을 목격했다.\n어떻게 할까?',
    answer: [
      {
        type: '탐정',
        text: '증거를 수집한다.',
      },
      {
        type: '시민',
        text: '바로 경찰에 신고한다.',
      },
      {
        type: '형사',
        text: '범인을 직접 쫓아간다.',
      },
      {
        type: '범인',
        text: '아무 말도 하지 않고 지켜본다.',
      },
    ],
  },
  {
    id: 2,
    question: '범인이 나를 의심하고 다가왔다.\n나는 어떻게 반응해야 할까?',
    answer: [
      {
        type: '탐정',
        text: '침착하게 대화하며 범인의 의도를 파악한다.',
      },
      {
        type: '시민',
        text: '지나가는 길이었다고 아무것도 못봤다고 한다.',
      },
      {
        type: '형사',
        text: '범인에게 정면으로 맞선다.',
      },
      {
        type: '범인',
        text: '나를 의심한 범인에게 반격한다.',
      },
    ],
  },
  {
    id: 3,
    question: '내가 사건을 조사하게 되었다.\n내 역할은 무엇일까?',
    answer: [
      {
        type: '시민',
        text: '믿음직한 사람의 보조로 행동한다.',
      },
      {
        type: '형사',
        text: '혼자서 범인을 추적한다.',
      },
      {
        type: '범인',
        text: '목격자와 인터뷰한다.',
      },
      {
        type: '탐정',
        text: '범죄 현장에서 단서를 찾는다.',
      },
    ],
  },
  {
    id: 4,
    question: '사건의 용의자가 나와 친분이 있다.\n어떻게 할까?',
    answer: [
      {
        type: '범인',
        text: '친분을 이유로 용의자를 변호한다.',
      },
      {
        type: '탐정',
        text: '감정을 배제하고 사실만을 바라본다.',
      },
      {
        type: '시민',
        text: '범인을 의심하고 나를 방어한다.',
      },
      {
        type: '형사',
        text: '직접 대면해서 진실을 묻는다.',
      },
    ],
  },
  {
    id: 5,
    question: '내가 사건의 증인으로 소환되었다.\n어떻게 행동해야 할까?',
    answer: [
      {
        type: '시민',
        text: '사실을 그대로 말한다.',
      },
      {
        type: '범인',
        text: '알리바이를 강조한다.',
      },
      {
        type: '탐정',
        text: '내가 아는 것 이상은 말하지 않는다.',
      },
      {
        type: '형사',
        text: '변호사를 부른다.',
      },
    ],
  },
  {
    id: 6,
    question: '범인을 잡은 후, 내가 생각하지 못한\n반전이 있었다. 무엇일까?',
    answer: [
      {
        type: '범인',
        text: '범인은 나를 지목하며\n진짜 범인을 덮어씌우려고 했다.',
      },
      {
        type: '탐정',
        text: '범인은 사실 내가 의심했던\n사람과는 전혀 관계가 없었다.',
      },
      {
        type: '시민',
        text: '범인이 내 친구였다는 사실이 드러났다.',
      },
      {
        type: '형사',
        text: '범인이 범행을 저지르기 위해\n나를 이용하려 했다.',
      },
    ],
  },
  {
    id: 7,
    question:
      '사건 해결 후, 내가 과거에 범죄를\n저질렀던 것이 밝혀졌다. 어떻게 대처할까?',
    answer: [
      {
        type: '범인',
        text: '과거를 숨기고 새 삶을 시작한다.',
      },
      {
        type: '시민',
        text: '과거를 인정하고 반성한다.',
      },
      {
        type: '형사',
        text: '피해자에게 진심으로 사과한다.',
      },
      {
        type: '탐정',
        text: '과거의 행동을 조사하고 진실을 밝힌다.',
      },
    ],
  },
];
